docs/providers/airblue-ndc-samples/Ancillary NDC API Samples/doAddAncillary_Seat_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.iata.org/IATA/2015/00/2020.1/IATA_OrderChangeRQ">
   <soapenv:Header/>
   <soapenv:Body>
      <IATA_OrderChangeRQ>
         <Party>
            <Sender>
               <TravelAgency>
                  <AgencyID>SELENS</AgencyID>
                  <Name>NDC GATEWAY</Name>
               </TravelAgency>
            </Sender>
         </Party>
         <PayloadAttributes>
            <PrimaryLangID>EN</PrimaryLangID>
         </PayloadAttributes>
         <Request>
            <ChangeOrder>
               <UpdateOrderItem>
                  <AcceptOffer>
                     <SelectedOffer>
                        <OfferRefID>OFFER-SEAT</OfferRefID>
                        <OwnerCode>4M</OwnerCode>
                        <SelectedOfferItem>
                           <OfferItemRefID>OFFERITEM</OfferItemRefID>
                           <PaxRefID>ADTPax-403002898</PaxRefID>
                           <SelectedALaCarteOfferItem>
                              <FlightAssociations>
                                 <DatedOperatingLegRefID>PK368-11Aug-KHIISB-NDE3ODM4MQ</DatedOperatingLegRefID>
                                 <PaxJourneyRefID>KHI-ISB-J1</PaxJourneyRefID>
                                 <PaxSegmentRefID>PK368-11Aug-KHIISB-NDE3ODM4MQ</PaxSegmentRefID>
                              </FlightAssociations>
                              <Qty>1</Qty>
                           </SelectedALaCarteOfferItem>
                           <SelectedSeat>
                              <ColumnID>20A</ColumnID>
                              <SeatRowNumber>20</SeatRowNumber>
                           </SelectedSeat>
                        </SelectedOfferItem>
                     </SelectedOffer>
                  </AcceptOffer>
               </UpdateOrderItem>
            </ChangeOrder>
            <DataLists>
               <OriginDestList>
                  <OriginDest>
                     <DestCode>ISB</DestCode>
                     <OriginCode>KHI</OriginCode>
                     <OriginDestID>OD-KHIISB</OriginDestID>
                     <PaxJourneyRefID>KHI-ISB-J1</PaxJourneyRefID>
                  </OriginDest>
               </OriginDestList>
               <PaxJourneyList>
                  <PaxJourney>
                     <PaxJourneyID>KHI-ISB-J1</PaxJourneyID>
                     <PaxSegmentRefID>PK368-11Aug-KHIISB-NDE3ODM4MQ</PaxSegmentRefID>
                  </PaxJourney>
               </PaxJourneyList>
               <PaxList>
                  <Pax>
                     <Birthdate>1974-04-16</Birthdate>
                     <Individual>
                        <TitleName>MR</TitleName>
                        <GivenName>ESTA</GivenName>
                        <Surname>EST</Surname>
                        <GenderCode>M</GenderCode>
                     </Individual>
                     <PaxID>PAX-ADT1</PaxID>
                     <PTC>ADT</PTC>
                     
                  </Pax>
        
               </PaxList>
               <PaxSegmentList>
                  <PaxSegment>
                     <Arrival>
                      <AircraftScheduledDateTime>2025-08-11T14:55:00+05:00</AircraftScheduledDateTime>
                        <IATA_LocationCode>ISB</IATA_LocationCode>
                        <StationName>Islamabad International Airpor</StationName>
                     </Arrival>
                     <CabinType>
                        <CabinTypeCode>Y</CabinTypeCode>
                        <CabinTypeName>ECONOMY</CabinTypeName>
                     </CabinType>
                     <Dep>
                       <AircraftScheduledDateTime>2025-08-11T13:00:00+05:00</AircraftScheduledDateTime>
                        <IATA_LocationCode>KHI</IATA_LocationCode>
                        <StationName>Jinnah Intl</StationName>
                     </Dep>
                     <Duration>PT1H55M</Duration>
                     <MarketingCarrierInfo>
                        <CarrierDesigCode>PK</CarrierDesigCode>
                        <MarketingCarrierFlightNumberText>368</MarketingCarrierFlightNumberText>
                     </MarketingCarrierInfo>
                     <OperatingCarrierInfo>
                        <CarrierDesigCode>PK</CarrierDesigCode>
                        <OperatingCarrierFlightNumberText>368</OperatingCarrierFlightNumberText>
                     </OperatingCarrierInfo>
                     <PaxSegmentID>PK368-11Aug-KHIISB-NDE3ODM4MQ</PaxSegmentID>
                  </PaxSegment>
               </PaxSegmentList>
               <ServiceDefinitionList>
                  <ServiceDefinition>
                     <Desc>
                        <DescText>20A</DescText>
                     </Desc>
                     <Name>SEAT</Name>
                     <ServiceCode>SEAT</ServiceCode>
                     <ServiceDefinitionID>ServiceDef-WN</ServiceDefinitionID>
                  </ServiceDefinition>
                  <ServiceDefinition>
                     <Desc>
                        <DescText>11A</DescText>
                     </Desc>
                     <Name>SEAT</Name>
                     <ServiceCode>SEAT</ServiceCode>
                     <ServiceDefinitionID>ServiceDef-MD</ServiceDefinitionID>
                  </ServiceDefinition>
               </ServiceDefinitionList>
            </DataLists>
            <Order>
               <OrderID>800EDK</OrderID>
               <OwnerCode>4M</OwnerCode>
            </Order>
            <OrderChangeParameters>
               <CurParameter>
                  <CurCode>PKR</CurCode>
               </CurParameter>
            </OrderChangeParameters>
         </Request>
      </IATA_OrderChangeRQ>
   </soapenv:Body>
</soapenv:Envelope>